blog/2015-01-24-initial-blog-post.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Blogging</a></li>
</ul>
</div>
</div>

---
layout: default
title: Obligatory Initial Blog Post
---

# Blogging<a id="sec-1" name="sec-1"></a>

I feel that I am not a very good writer. This of course has to do with
the fact that I generally haven't practiced in well &#x2026; ever. Not that
my grammar or the structure in which I arrange essays is abhorrent,
it's just that like many science/tech minded students out there, I've
been under the illusion that writing is for right-brained English
majors and not left-brained Engineers.

However, upon beginning my programming career I've discovered that
most, if not all, good programmers tend to keep up-to-date blogs and
that I might as well join the party and keep one myself. Most of my
current blogging efforts will be spent compiling solutions to the
(in)famous [Structure and Interpretation of Computer Programs](http://mitpress.mit.edu/sicp/), so there
probably won't be too many enlightening posts on other topics for a
bit.

Also, In case you're interested, this blog is powered (I use that word
loosely, since it is entirely static) by [Jekyll](http://jekyllrb.com/) and [Github Pages](https://pages.github.com/) and
is built using good 'ol [Emacs](http://www.gnu.org/software/emacs) and [Org-Mode](http://orgmode.org/).